Revit 2024 API
DirectShapeReferenceOptions Constructor
 Constructs a new DirectShapeRefOptions instance with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public DirectShapeReferenceOptions()
Visual Basic
Public Sub New
Visual C++
public:
DirectShapeReferenceOptions()
See Also
DirectShapeReferenceOptions Class
DirectShapeReferenceOptions Overload
Autodesk.Revit.DB Namespace